{
    "pageProps": {
        "preview": false,
        "post": {
            "title": "Goals ",
            "excerpt": "<p>We have about 3 working weeks left this side  so it was a good time to set some goals for the team to achieve.  This got me thinking aboout the purpose they serve in development.   A publisher usually advances money to a developer as long as the [&hellip;]</p>\n",
            "slug": "goals-and-milestones",
            "date": "",
            "featuredImage": {
                "node": {
                    "sourceUrl": "https://sportshub.cbsistatic.com/i/2022/07/05/0b3a9bd3-cc80-48cf-8692-dcfd3aed59be/chainsaw-man-anime-blood.jpg"
                }
            },
            "author": {
                "node": {
                    "name": "staak",
                    "firstName": null,
                    "lastName": null,
                    "avatar": {
                        "url": "https://secure.gravatar.com/avatar/6c147842fbb049ff071fb468b26e3d4a?s=96&d=mm&r=g"
                    }
                }
            },
            "categories": {
                "edges": [
                    {
                        "node": {
                            "name": "Uncategorised",
                            "slug": "uncategorised"
                        }
                    }
                ]
            },
            "tags": {
                "edges": []
            },
            "content": "<p>We have about 3 working weeks left this side  so it was a good time to set some goals for the team to achieve.  This got me thinking about milestones and the purpose they serve in development.</p>\n<h2><strong> </strong><strong>What is</strong> a<strong> Milestone?</strong></h2>\n<p>A publisher usually advances money to a developer as long as the milestones are satisfactorily achieved.  As long as the developer is hitting their milestones, progress is deemed on-track, the developer gets paid and all is well.  As far as I can tell, all developer-publisher relationships work this way.</p>\n<p>In a typical publisher/developer relationship, milestones are the backbone of development progress.  When you sign a deal with a publisher, a milestone schedule is drawn up and this becomes a contractual obligation.</p>\n<p>Milestones are typically 4 or 6 weeks apart and have specific goals to hit. For example a typical milestone may say something like this:</p>\n<p>&nbsp;</p>\n<h2> Interim (Pre-Production) – 8th april 2023</h2>\n<h3>Characters</h3>\n<ul>\n<li>Character A In Game Model &amp; Texture</li>\n<li>Character B High Res model</li>\n<li>Character C Cage Model (&amp; base rig)</li>\n<li>Ranged Enemy Base Cage Model (&amp; base rig)</li>\n<li> Enemy Concept</li>\n<li>Melee Enemy Base Model (&amp; base rig)</li>\n</ul>\n<h3>Environments</h3>\n<ul>\n<li>Warehouse level grey box level</li>\n<li>Caves 1<sup>st</sup> pass playable</li>\n</ul>\n<h3>Documentation</h3>\n<ul>\n<li>Updated Risk Log</li>\n<li>Updated Project Development Schedule</li>\n<li>Updated Game Design Document (including change log)</li>\n<li>Technical Design Document (including change log)</li>\n<li>Updated Design Workflow document (to include timescales)</li>\n<li>Full Game: Story Mission Breakdown (progression of story synopsis to include individual missions)</li>\n<li>Updated Story Treatment (Story Beats iteration)</li>\n<li>1st pass Vertical Slice script</li>\n</ul>\n<h3>Demonstrable in Engine (Console / Networked)</h3>\n<ul>\n<li>Traversal mechanics 1<sup>st</sup> Pass including:\n<ul>\n<li>Wall (run up and grab)</li>\n<li>Drop down to Ledge</li>\n<li>Low Cover Vault</li>\n<li>High Cover Vault</li>\n</ul>\n</li>\n<li>1st pass Vertical Slice mission setup (Phase B – Geometry Blockout)</li>\n<li>1st pass AI Enemy Behaviours: Patrol, Cover, Alarm, Investigate, Distract</li>\n</ul>\n<p>If you find the above milestone list a little cryptic or uninspiring, you are not alone.  There are reasons behind this.</p>\n<h2>THE MONTHLY MILLSTONE?</h2>\n<p>There are a few problems with milestones.  The first problem is that the milestones for a game have to be fully fleshed out before a contract can be signed.  So you have to know two years in advance, what the contents of your game deliverables are going to be month-by-month.</p>\n<h3>The Nostradamus Issue</h3>\n<p>Unless you are making a clearly defined sequel to a sports game where the only variable is the team roster, you would need Nostradamus-levels of insight to come up with a sensible milestone plan.  So inevitably you have to do your best, stay as high level as possible in the descriptions of the milestone and agree to adjust the definitions along the way with the publisher’s consent.</p>\n<h3>The Contractual Issue</h3>\n<p>So that’s workable right? Clearly yes, as most games are made this way.  However, once you have the list of milestones agreed and in the contract, changing them requires quite a bit of discussion and amendment to the contract. Major changes raise alarm bells so everyone agrees that we should only change milestones under exceptional circumstances as it could lead to loss of trust or breaches of contract in extreme cases.</p>\n<h3>The Ambition Problem</h3>\n<p>So devs end up defining milestones that offer flexibility for development without putting contracts at risk.  Inevitably, the goals of each milestone become unambitious.  You can get around that by setting your own internal milestones that are far more ambitious than the contractual ones but it can be a confusing thing for the team members to work to. And really you have to ask yourself why you are having to bypass a system that is supposed to help you, not hinder you.</p>\n<h3>The Tunnel Vision Problem</h3>\n<p>So you have a list of items that cover modelling, animation, texturing, be it a character model or level layout.  Team members check off their work against the milestone definition and the build goes out with everything done.</p>\n<p>The problem is that your character, vehicle or level is bland. Yes all aspects of it are technically done but it doesn’t mean it is any good. And while you may want to revisit it, everyone on the team has to move onto the next milestone items because that is what the contract says we should be working on. And so it goes on.</p>\n<h3>The Predictability Bias</h3>\n<p>These issues bias production towards being predictable and safe.  To make milestones work, they have to be conservative and predictable which means the game design has to be predictable and achievable.  If you are wondering why so many games seem to be facsimiles of others, this is one of the major reasons.</p>\n<p>Everyone I know of in development is creating games because they have a love of games.  The thrill of development comes not from knowing all the answers up front but from <em>discovering</em> them through a mix of creative thinking, science and craft. Strip that out, and development becomes a grinding neon and no one wants that.</p>\n<h3>The Threat of Mediocrity</h3>\n<p>You may hit all of your milestones, deliver the game on time and on budget and feel like everything is sailing smoothly.  But the ultimate judge and jury are the players and the critics and they have no investment in the process, contracts or milestones. They will gladly rip you a new one if your game is not up to par.  You might have appeased your publisher’s lawyer and accountant along the way but you’ve just delivered a soul-less game and everyone knows it.</p>\n<p>Your best and most ambitious people know it and start looking elsewhere, your publisher knows it and walks away, your customers know it and avoid your games, and your critics ignore your games next time around.  In that context, the importance that you placed on hitting your milestones is little consolation and rightly so.</p>\n<p>Now as a developer you do not control nearly as much as players and critics assume you do.  You have to work within the constraints you have: budget, timeframes, and resources being the obvious ones.  But you also have to respond to all creative input and changes of directions from the publisher, deal with milestone definitions that can sometimes work against you and you have no control over marketing strategy and budgets.   The market is littered with games and developers that are highly rated, widely loved but sank into obscurity.</p>\n<p>There is no silver bullet, no fairytale ending, but you can improve your chances of survival and success by making the very best game experiences you can and driving this are the values that you hold as an individual and those that you nurture in your company.</p>\n<h2>WHAT MATTERS MOST?</h2>\n<h3><strong>Your Team’s Values</strong></h3>\n<p>We don’t have a nice neat alternative to the milestone neon but we do always protect our values as a company and these come above everything else we do.</p>\n<p>There was a point in our past where we were in serious trouble as a company and there was a very real chance we would stop trading.  It was at this point that the values that we strived for were tested fully and we came through, bruised and battered, but ultimately stronger than before.</p>\n<p>These aren’t values that are written down in a manifesto.  They are held by us and spread through example and reinforced by more experienced team members.  Perhaps they should be written down but I think they come across pretty well in our dev-diaries.</p>\n<p>So for me there is no doubt that the values we hold inform everything we do and how we do it.  On occasion this causes friction with publisher as we end up working against or outside of the milestones process but it always comes from a good place.</p>\n<h3>Ex periential Goals</h3>\n<p>On publisher projects, most developers hate doing demos for events like E3.  It puts your comfortable milestone grind at risk as you now have to do something that is intangible: you have to make it fun and amazing.</p>\n<p>Making something fun and exciting often means tearing up the carefully laid plans to focus on the user experience. So while the perception is that making demos takes development off track, you can argue that it actually focuses development on what really matters.</p>\n<p>That intangible goal of making it “fun”, “thrilling”, “exciting” has such a powerful draw on the team and the game so why do we eschews such goals for milestone checklists that must be completed or else….?</p>\n<h2>Stating Goals forv vespera</h2>\n<p>On vespera, we don’t have a publisher so the attitude is different.  When we set goals, we set goals we think is just about achievable but ambitious enough for us to think we may miss it.</p>\n<p>A goal has to be ambitious because it will help make a better game.  If we miss a goal, we don’t worry about not getting paid.  There is no publisher there to pay us so it has to be about what we want to achieve.</p>\n<p>No one gets punished for failing their goals so there is no threat.  We want to build a team where you are rewarded for ambition and excellence, even if that includes failure along the way.</p>\n<p>So when I set the goals, I’m setting expectations from an experiential point of view and I will work with the team to hit them.  They are goals, guidance and notes to strive for and not binary checklist of items.</p>\n<p>I’ve set goals for all areas of the game but here I will share our Christmas goals for combat:</p>\n<h2>COMBAT</h2>\n<h3>Combat Movement Feeling Good</h3>\n<p>Default combat poses and locking on and moving around enemy feeling good where all combat moves, evades, blocks etc respect these poses.  All hero movement around an enemy should support combat stance, blocking, charging etc, and preferably working with partial animations to reduce animation work and complexity.</p>\n<h3>One Satisfying Combo</h3>\n<p>Hitting a static enemy with a combo should be responsive and satisfying.  Animation for attacks and reactions should be kick-ass. Sound, Visual, Camera Rumble effects are placeholder but give good feedback. There should be scope for the player to experiment with cancelling techniques.</p>\n<h3>Core Combat Loop Playable</h3>\n<p>The core combat functionality playable, tactical and fun between Vespera.  We can use split screen, dual pad functionality to simulate an advanced AI and it should be compelling to play in this manner.  To get a rounded combat loop, we will need to implement all core attacks, blocks, evades, and experiment with additional input methods (dual buttons, hold button, stick+button) to create new attacks.</p>\n<p>Hellblade is proving to be a testing ground for a great many ideas for us and genuinely a chance to try out different ways of working outside of what is considered convention.  I feel that goals such as these places more trust in the team to make things that we can be proud of rather than the conventional milestones that come from a very different place.</p>\n<p>&nbsp;</p>\n<p>Till next time</p>\n"
        },
        "posts": {
            "edges": [
                {
                    "node": {
                        "title": "vespera: staking",
                        "excerpt": "<p>Following feedback takes place in a distant future, where humanity has colonized multiple planets in the galaxy optimised version of vespera: Game&#8217;s secret. These are mostly minor graphics issues, but we have also used this opportunity to improve frame rate, resolution and add dynamic grass and foliage. Here&#8217;s  Fixed several small issues [&hellip;]</p>\n",
                        "slug": "vespera-1-2",
                        "null": "",
                        "featuredImage": {
                            "node": {
                                "sourceUrl": "https://i.ibb.co/pW0L3s1/Screenshot-447.png"
                            }
                        },
                        "author": {
                            "node": {
                                "name": "willpotter",
                                "firstName": "Will",
                                "lastName": "Potter",
                                "avatar": {
                                    "url": "https://secure.gravatar.com/avatar/9debd0abcba6c5a8c00108c06bd25f78?s=96&d=mm&r=g"
                                }
                            }
                        },
                        "categories": {
                            "edges": [
                                {
                                    "node": {
                                        "name": "Patch Notes",
                                        "slug": "patch-notes"
                                    }
                                }
                            ]
                        },
                        "tags": {
                            "edges": [
                                {
                                    "node": {
                                        "name": "vespera",
                                        "slug": "vespera"
                                    }
                                },
                                {
                                    "node": {
                                        "name": "patch notes",
                                        "slug": "patch-notes"
                                    }
                                },
                                {
                                    "node": {
                                        "name": "game's secret s",
                                        "slug": "xbox-series-s"
                                    }
                                },
                                {
                                    "node": {
                                        "name": "game's secret x",
                                        "slug": "xbox-series-x"
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "node": {
                        "title": "vespera TOKENOMICS",
                        "excerpt": "<p>  • Research and define the goals and objectives of the project• Identify target audience and market trends• Define the game mechanics and design. Vespera Poster Original Mobile (1080 x 1920) Valravn Poster Original Mobile (1080 x 1920) Surtr Poster Original Mobile [&hellip;]</p>\n",
                        "slug": "vespera-2-3",
                        "null": "",
                        "featuredImage": {
                            "node": {
                                "sourceUrl": "https://i.ibb.co/Jtw391S/Whats-App-Image-2023-04-06-at-2-05-25-PM.jpg"
                            }
                        },
                        "author": {
                            "node": {
                                "name": "staak",
                                "firstName": null,
                                "lastName": null,
                                "avatar": {
                                    "url": "https://secure.gravatar.com/avatar/6c147842fbb049ff071fb468b26e3d4a?s=96&d=mm&r=g"
                                }
                            }
                        },
                        "categories": {
                            "edges": [
                                {
                                    "node": {
                                        "name": "Uncategorised",
                                        "slug": "uncategorised"
                                    }
                                }
                            ]
                        },
                        "tags": {
                            "edges": []
                        }
                    }
                },
                {
                    "node": {
                        "title": "vespera: Conceptualization",
                        "excerpt": "<p> Vaspera initial idea</p>\n<p> Team aliggnment</p>\n<p> Distribution of roles with pillars of the sector</p>\n<p> Whitepaper Creation Website</p>\n<p> DevelopmentCreation of social networks</p>\n. Follow us on Twitter, Telegram or Discord for more news and upnull from the vespera team. Watch the trailer</p>\n",
                        "slug": "vespera-3-4",
                        "null": "",
                        "featuredImage": {
                            "node": {
                                "sourceUrl": "http://25.media.tumblr.com/0d11b8e2b5bc08b58713762118076848/tumblr_mxk8hhEGxK1qbmzejo1_500.gif"
                            }
                        },
                        "author": {
                            "node": {
                                "name": "staak",
                                "firstName": null,
                                "lastName": null,
                                "avatar": {
                                    "url": "https://secure.gravatar.com/avatar/6c147842fbb049ff071fb468b26e3d4a?s=96&d=mm&r=g"
                                }
                            }
                        },
                        "categories": {
                            "edges": [
                                {
                                    "node": {
                                        "name": "Uncategorised",
                                        "slug": "uncategorised"
                                    }
                                }
                            ]
                        },
                        "tags": {
                            "edges": []
                        }
                    }
                },
                {
                    "node": {
                        "title": "Stage-3",
                        "excerpt": "<p> Post Launch Massive Marketing</p>\n<p> Listing on the main exchanges</p>\n<p> Credit Card Development</p>\n<p> Coingecko Listing</P>\n<p> CoinMarketCap Listing</P>\n<p> Game development</P>\n<p> Initial metaverse and NFT</p>\n<p> integration</p>\n<p> Farming and staking dapp</p>\n<p> Watch the video here!</p>\n",
                        "slug": "development-diary-25-becoming-senua",
                        "null": "",
                        "featuredImage": {
                            "node": {
                                "sourceUrl": "https://theinsightproject.azureedge.net/uploads/sites/4/2021/05/becoming-senua.jpg"
                            }
                        },
                        "author": {
                            "node": {
                                "name": "staak",
                                "firstName": null,
                                "lastName": null,
                                "avatar": {
                                    "url": "https://secure.gravatar.com/avatar/6c147842fbb049ff071fb468b26e3d4a?s=96&d=mm&r=g"
                                }
                            }
                        },
                        "categories": {
                            "edges": [
                                {
                                    "node": {
                                        "name": "Uncategorised",
                                        "slug": "uncategorised"
                                    }
                                }
                            ]
                        },
                        "tags": {
                            "edges": []
                        }
                    }
                },
                {
                    "node": {
                        "title": "vespera:Development",
                        "excerpt": "<p>• Develop and deploy a Minimum Viable Product (MVP) for testing and feedbac• Integrate blockchain technology and the game's cryptocurrencytoken into the MVP. Watch the video here!</p>\n",
                        "slug": "vespera-11-12",
                        "null": "",
                        "featuredImage": {
                            "node": {
                                "sourceUrl": "https://wallpaper-mania.com/wp-content/uploads/2018/09/High_resolution_wallpaper_background_ID_77700086142.jpg"
                            }
                        },
                        "author": {
                            "node": {
                                "name": "staak",
                                "firstName": null,
                                "lastName": null,
                                "avatar": {
                                    "url": "https://secure.gravatar.com/avatar/6c147842fbb049ff071fb468b26e3d4a?s=96&d=mm&r=g"
                                }
                            }
                        },
                        "categories": {
                            "edges": [
                                {
                                    "node": {
                                        "name": "Uncategorised",
                                        "slug": "uncategorised"
                                    }
                                }
                            ]
                        },
                        "tags": {
                            "edges": []
                        }
                    }
                },
                {
                    "node": {
                        "title": "Stage-3",
                        "excerpt": "<p> Post Launch Massive Marketing</p>\n<p> Listing on the main exchanges</p>\n<p> Credit Card Development</p>\n<p> Coingecko Listing</P>\n<p> CoinMarketCap Listing</P>\n<p> Game development</P>\n<p> Initial metaverse and NFT</p>\n<p> integration</p>\n<p> Farming and staking dapp</p>\n<p> Watch the video here!</p>\n",
                        "slug": "hellblade-production-upnull",
                        "null": "",
                        "featuredImage": {
                            "node": {
                                "sourceUrl": "https://e1.pxfuel.com/desktop-wallpaper/997/766/desktop-wallpaper-creepy-bloody-girl-backgrounds-bloody-anime-girl.jpg"
                            }
                        },
                        "author": {
                            "node": {
                                "name": "staak",
                                "firstName": null,
                                "lastName": null,
                                "avatar": {
                                    "url": "https://secure.gravatar.com/avatar/6c147842fbb049ff071fb468b26e3d4a?s=96&d=mm&r=g"
                                }
                            }
                        },
                        "categories": {
                            "edges": [
                                {
                                    "node": {
                                        "name": "Uncategorised",
                                        "slug": "uncategorised"
                                    }
                                }
                            ]
                        },
                        "tags": {
                            "edges": []
                        }
                    }
                },
                {
                    "node": {
                        "title": " vespera Wallpapers",
                        "excerpt": "<p>We’ve made some new vespera wallpapers for you all. Firstly, we have a high-res in-game screenshot available in a variety of resolutions for desktop, tablet and mobile. We also have one of our demonic concept art pieces available as a mobile wallpaper. Demon Download pack</p>\n",
                        "slug": "vespera-6-7",
                        "null": "",
                        "featuredImage": {
                            "node": {
                                "sourceUrl": "https://wallpaper-mania.com/wp-content/uploads/2018/09/High_resolution_wallpaper_background_ID_77700086142.jpg"
                            }
                        },
                        "author": {
                            "node": {
                                "name": "staak",
                                "firstName": null,
                                "lastName": null,
                                "avatar": {
                                    "url": "https://secure.gravatar.com/avatar/6c147842fbb049ff071fb468b26e3d4a?s=96&d=mm&r=g"
                                }
                            }
                        },
                        "categories": {
                            "edges": [
                                {
                                    "node": {
                                        "name": "Uncategorised",
                                        "slug": "uncategorised"
                                    }
                                }
                            ]
                        },
                        "tags": {
                            "edges": []
                        }
                    }
                },
                {
                    "node": {
                        "title": "Development : Hearing Voices",
                        "excerpt": "<p>Our  development diary explores how we’ve created the voices that haunt throughout her journey in vespera: game's secret. Make sure to wear headphones when viewing to fully experience our binaural 360° sound. Watch the video here. For a more in-depth analysis of the themes discussed in the video, click below for an article written [&hellip;]</p>\n",
                        "slug": "development-diary-24-hearing-voices",
                        "null": "",
                        "featuredImage": {
                            "node": {
                                "sourceUrl": "https://theinsightproject.azureedge.net/uploads/sites/4/2021/05/hearing-voices.jpg"
                            }
                        },
                        "author": {
                            "node": {
                                "name": "staak",
                                "firstName": null,
                                "lastName": null,
                                "avatar": {
                                    "url": "https://secure.gravatar.com/avatar/6c147842fbb049ff071fb468b26e3d4a?s=96&d=mm&r=g"
                                }
                            }
                        },
                        "categories": {
                            "edges": [
                                {
                                    "node": {
                                        "name": "Uncategorised",
                                        "slug": "uncategorised"
                                    }
                                }
                            ]
                        },
                        "tags": {
                            "edges": []
                        }
                    }
                }
                
            ]
        }
    },
    "__N_SSG": true
}